# Pandas 3
Â© Advanced Analytics, Amir Ben Haim, 2024

<br>
<hr class="dotted">
<br>

## Grouping the data

<br>
<br>

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({ 'OrderID': [1000, 1000, 1000, 1000, 2000, 2000, 3000, 3000, 3000, 4000],
                     'ProductID': ['xxx', 'yyy', 'zzz', 'xxx','yyy','www','xxx', 'yyy', 'yyy', 'www'],
                     'Qty': [10,30,20,40,50,80,90,80,20,30],
                     'Rev' : [100,200,300,400,500,600,700,800, 100, 40]
                   })
df

   OrderID ProductID  Qty  Rev
0     1000       xxx   10  100
1     1000       yyy   30  200
2     1000       zzz   20  300
3     1000       xxx   40  400
4     2000       yyy   50  500
5     2000       www   80  600
6     3000       xxx   90  700
7     3000       yyy   80  800
8     3000       yyy   20  100
9     4000       www   30   40

In [3]:
df.groupby('OrderID').Rev.sum()

OrderID
1000    1000
2000    1100
3000    1600
4000      40
Name: Rev, dtype: int64

In [4]:
df.groupby('OrderID')['Rev'].sum()

OrderID
1000    1000
2000    1100
3000    1600
4000      40
Name: Rev, dtype: int64

In [5]:
dfg = df.groupby('OrderID')[['Rev','Qty']].sum()
dfg

          Rev  Qty
OrderID
1000     1000  100
2000     1100  130
3000     1600  190
4000       40   30

In [ ]:
type(dfg)

In [ ]:
dfg.columns

In [ ]:
dfg.index

In [ ]:
dfg.dtypes

In [ ]:
dfg

In [ ]:
dfg.loc[   2000 , 'Qty'  ]

In [ ]:
dfg.loc[2000]

In [ ]:
dfg.iloc[1,1]

In [ ]:
df

<br>
<hr class="dotted">
<br>

## `groupby()` with 2 columns or more

<br>
<br>

In [ ]:
df

In [13]:
df.groupby(['OrderID','ProductID'])[['Rev','Qty']].sum()

                   Rev  Qty
OrderID ProductID
1000    xxx        500   50
        yyy        200   30
        zzz        300   20
2000    www        600   80
        yyy        500   50
3000    xxx        700   90
        yyy        900  100
4000    www         40   30

In [ ]:
df

In [ ]:
list(df.index)

In [14]:
g = df.groupby(['OrderID','ProductID'])[['Rev','Qty']].sum()
g

                   Rev  Qty
OrderID ProductID
1000    xxx        500   50
        yyy        200   30
        zzz        300   20
2000    www        600   80
        yyy        500   50
3000    xxx        700   90
        yyy        900  100
4000    www         40   30

In [15]:
list(g.index)

[(1000, 'xxx'),
 (1000, 'yyy'),
 (1000, 'zzz'),
 (2000, 'www'),
 (2000, 'yyy'),
 (3000, 'xxx'),
 (3000, 'yyy'),
 (4000, 'www')]

In [16]:
g.loc[1000]

           Rev  Qty
ProductID
xxx        500   50
yyy        200   30
zzz        300   20

In [ ]:
g.loc[  (1000,'xxx')   ]

In [ ]:
g.loc[  (2000,'www')   ]

In [ ]:
g

In [ ]:
g.loc[1000:3000]

In [ ]:
g

In [ ]:
g.loc[(1000,'xxx'):(2000,'www')]

In [ ]:
g

In [17]:
df.groupby(['OrderID','ProductID'])[['Rev','Qty']].sum()

                   Rev  Qty
OrderID ProductID
1000    xxx        500   50
        yyy        200   30
        zzz        300   20
2000    www        600   80
        yyy        500   50
3000    xxx        700   90
        yyy        900  100
4000    www         40   30

In [18]:
df.groupby(['OrderID','ProductID'], as_index=False)[['Rev','Qty']].sum()

   OrderID ProductID  Rev  Qty
0     1000       xxx  500   50
1     1000       yyy  200   30
2     1000       zzz  300   20
3     2000       www  600   80
4     2000       yyy  500   50
5     3000       xxx  700   90
6     3000       yyy  900  100
7     4000       www   40   30

In [ ]:
df.groupby('OrderID', as_index=False)[['Rev','Qty']].sum()

In [ ]:
df.groupby('OrderID')['Rev'].sum()

In [ ]:
df.groupby('OrderID', as_index=False)['Rev'].sum()

In [ ]:
df.groupby('OrderID', as_index=False)[['Rev','Qty']].sum()

<br>

<font size="5">Small conclusion</font>

we can control wheter the grouped column will be used as an Index or not (`as_index=False`)!

<br>
<hr class="dotted">
<br>

## `agg()` method

<br>
<br>

In [11]:
df.groupby('OrderID', as_index=False)[['Rev','Qty']].sum()

   OrderID   Rev  Qty
0     1000  1000  100
1     2000  1100  130
2     3000  1600  190
3     4000    40   30

In [12]:
df.groupby('OrderID', as_index=False).agg( {'Rev':'sum', 'Qty':'mean'}  )

   OrderID   Rev        Qty
0     1000  1000  25.000000
1     2000  1100  65.000000
2     3000  1600  63.333333
3     4000    40  30.000000

In [ ]:
dfg = df.groupby('OrderID', as_index=False).agg({'Rev':'sum', 'Qty':'mean'})
dfg

In [ ]:
dfg.rename(columns={'Rev':'Rev_sum', 'Qty':'Qty_mean'}, inplace=True)


dfg

In [19]:
df.groupby('OrderID', as_index=False).agg(   {   'Rev':['sum','mean'],   'Qty':['min','max']     }     )

  OrderID   Rev             Qty
            sum        mean min max
0    1000  1000  250.000000  10  40
1    2000  1100  550.000000  50  80
2    3000  1600  533.333333  20  90
3    4000    40   40.000000  30  30

In [22]:
g = df.groupby('OrderID', as_index=False).agg({'Rev':['sum','mean'], 'Qty':['min','max']})
g

  OrderID   Rev             Qty
            sum        mean min max
0    1000  1000  250.000000  10  40
1    2000  1100  550.000000  50  80
2    3000  1600  533.333333  20  90
3    4000    40   40.000000  30  30

In [ ]:
g.columns

In [ ]:
g['OrderID']

In [ ]:
g['Rev']

In [ ]:
g[('Rev','mean')]

In [ ]:
g

In [23]:
list(g.columns)

[('OrderID', ''),
 ('Rev', 'sum'),
 ('Rev', 'mean'),
 ('Qty', 'min'),
 ('Qty', 'max')]

In [24]:
[  f'{v[0]}_{v[1]}'       for v in  list(g.columns)        ]

['OrderID_', 'Rev_sum', 'Rev_mean', 'Qty_min', 'Qty_max']

In [25]:
g

  OrderID   Rev             Qty
            sum        mean min max
0    1000  1000  250.000000  10  40
1    2000  1100  550.000000  50  80
2    3000  1600  533.333333  20  90
3    4000    40   40.000000  30  30

In [26]:
g.columns = [  f'{v[0]}_{v[1]}'   for v in  list(g.columns)    ]
g

   OrderID_  Rev_sum    Rev_mean  Qty_min  Qty_max
0      1000     1000  250.000000       10       40
1      2000     1100  550.000000       50       80
2      3000     1600  533.333333       20       90
3      4000       40   40.000000       30       30

<br>
<hr class="dotted">
<br>

## Using `DataFrameGroupBy`

<br>
<br>

<p style="font-size:20px">  Now we have a new object, which is a little bit different from a DataFrame 'DataFrameGroupBy'</p>

In [ ]:
df.groupby('OrderID', as_index=False).Rev.sum()

In [ ]:
df.groupby('OrderID').Rev.sum()

In [ ]:
df.groupby('OrderID')

In [ ]:
type(df.groupby('OrderID'))

In [8]:
grouped = df.groupby('OrderID')
grouped

<br>

<font size="5">Small conclusion</font>

When we use `groupby()` with an aggregative fumction such as `sum()` we get either a "DataFrame" or a "Series" object (Depends on how many columns).<br>
When we use `groupby()` without an aggregative function we get "DataFrameGroupBy" object

<br>

In [7]:
df

   OrderID ProductID  Qty  Rev
0     1000       xxx   10  100
1     1000       yyy   30  200
2     1000       zzz   20  300
3     1000       xxx   40  400
4     2000       yyy   50  500
5     2000       www   80  600
6     3000       xxx   90  700
7     3000       yyy   80  800
8     3000       yyy   20  100
9     4000       www   30   40

In [ ]:
type(df)

In [ ]:
df.describe()

In [ ]:
grouped

In [ ]:
grouped.describe()

In [ ]:
df

In [9]:
# We can use different methods to use on this object, like the "size" method
grouped.size()

OrderID
1000    4
2000    2
3000    3
4000    1
dtype: int64

In [10]:
# First Value
grouped.first()

        ProductID  Qty  Rev
OrderID
1000          xxx   10  100
2000          yyy   50  500
3000          xxx   90  700
4000          www   30   40

In [ ]:
grouped[['Qty','Rev']].mean()

In [ ]:
grouped.count()

In [ ]:
grouped.min()

In [ ]:
grouped.max()

In [ ]:
grouped.sum()

In [ ]:
grouped[['Rev','Qty']].sum()

In [ ]:
df

In [ ]:
# Our 'df.sum()' is very different than our 'grouped.sum()' because they are different objects
df.sum()

<br>
<br>
<p style="font-size:20px"> And many more aggregative function: </p>
Scroll a little bit down the page
<br>

[more agg function](https://pandas.pydata.org/docs/user_guide/groupby.html#aggregation)

<br>
<hr class="dotted">
<br>

## Using `lambda` Functions with `df`

<br>
<br>

In [ ]:
lambda x : x * 0.9

In [ ]:
(lambda x : x * 0.9)(100)

In [ ]:
df

In [ ]:
# Anonymus
df['RevAfterDiscount'] = df.Rev.apply(lambda x : x * 0.9)
df

<br>

<font size="5">We can also do that with `def` function</font>

In [ ]:
def discount(x):
    return x * 0.9

In [ ]:
df['RevAfterDiscount_2'] = df.Rev.apply(discount)
df

<br>

<font size="6">Another Example</font>

In [ ]:
df = df[['OrderID','ProductID','Qty','Rev']]
df

<br>

<font size="4">Creating another column **OnSale**</font>
<br>
<font size="4" color='red'>The logic doesn't matter</font>

In [ ]:
df.loc[:,'OnSale'] = df.index % 2 != 0
df

<br>

<font size="5">Simple example of how to write a <u>**One Liner `IF`**</u></font>

<br>

<font size="4">NOT - <u>**One Liner `IF`**</u></font>

In [ ]:
row = df.loc[1]

if row['OnSale']:
     print(row['Rev'] * 0.5)
else:
    print(row['Rev'])

<br>

<font size="4">YES - <u>**One Liner `IF`**</u></font>

In [ ]:
row = df.loc[1]

print(row['Rev'] * 0.5) if row['OnSale'] else print(row['Rev'])

<br>

<font size="5">Using the <u>**One Liner `IF`**</u> with `lambda` function</font>

In [ ]:
(lambda row :   row['Rev'] * 0.5 if row['OnSale'] else row['Rev'])

In [ ]:
row = df.loc[1]

(lambda row :   row['Rev'] * 0.5 if row['OnSale'] else row['Rev'])(row)

<br>

<font size="5">Using the <u>**One Liner `IF`**</u> with `lambda` function - <u>WITH A `df`</u></font>

In [ ]:
discount = 0.5

df['discounted_rev'] = df.apply(  lambda row   :   row['Rev'] * discount if row['OnSale'] else row['Rev'], axis=1  )
df

In [ ]:
df.drop('discounted_rev',axis=1, inplace=True)
df

<br>
<hr class="dotted">
<br>

## Using `lambda` Functions with `groupby()`

<br>
<br>

In [ ]:
grouped = df.groupby('OrderID', as_index=False)
grouped

In [ ]:
grouped.Rev.sum()

In [ ]:
df

In [ ]:
transformed = grouped.Rev.transform(lambda x : x.sum())
transformed

In [ ]:
# Changing Series 'name', for the 'join', so we dont have 2 columns with the same name
transformed.name = 'OrderRev'
transformed.name

In [ ]:
df2 = df.join(transformed)
df2

In [ ]:
df2['SalePer%FromOrder'] = df2['Rev'] / df2['OrderRev']
df2[['OrderID', 'ProductID', 'Qty', 'Rev', 'OrderRev', 'SalePer%FromOrder']]